In [1]:
import pandas as pd

In [2]:
orders = pd.read_csv('data/orders.csv')
orders.head()

   payment_id  user_id               created_at  payment_sum
0           2        2  2019-12-09 16:57:19.000        42.26
1           4        4  2019-12-10 03:49:35.000        18.25
2           6        6  2019-12-12 00:19:08.000        10.52
3           7        7  2019-12-13 15:15:30.000        14.02
4           8        8  2019-12-14 00:02:06.000        10.78

In [3]:
users = pd.read_csv('data/users.csv')
users.head()

,id,email,reg_date,first_name,last_name,country,user_uuid
0,1124,ts2000@hotmail.com,2020-06-28,Timothy,Simmons,US,a7c9b0bd-475e-4e49-8c4f-ff78063cff2e
1,1766,martinez1985@bing.com,2020-09-20,Jose,Martinez,China,73682891-8f7e-4890-a32a-0422437a588d
2,4132,patton1986@gmail.com,2021-09-01,Maria,Patton,India,5e77f1a0-af6f-4216-99fc-b91d2f7fdd63
3,3662,jonathan.vaughan@mail.com,2021-06-23,Jonathan,Vaughan,China,557118ac-5bf9-4765-a036-b781daf93597
4,4804,bsingleton@mail.com,2021-12-15,Bradley,Singleton,Germany,fc8a9241-3e12-4c77-b21a-fd6e9b6466b4

In [10]:
(
    users
    .merge(orders, how='left', left_on='id', right_on='user_id')
    .groupby('id')
    .agg({'email': 'first', 'payment_sum': 'sum'})
)

                         email  payment_sum
id
2             bklein@yahoo.com        52.19
3             kthomas@mail.com         0.00
4        carroll2021@yahoo.com        42.76
6         bishop2005@gmail.com        10.52
7         jacob.allen@bing.com        43.58
...                        ...          ...
7329      sanders1983@mail.com        21.28
7330  nathaniel.lucas@mail.com        23.01
7331         may1980@yahoo.com        12.71
7332         reed2022@bing.com        18.58
7333   grace.castillo@mail.com        18.55

[5567 rows x 2 columns]

In [13]:
items = pd.read_csv('data/items.csv', index_col='book_id')
line_items = pd.read_csv('data/line_items.csv')
line_items['sub_total'] = line_items['quantity'] * line_items['price']

In [24]:
(
    orders
    .merge(line_items, how='inner', on='payment_id')
    .merge(items, how='left', left_on='item_id', right_index=True)
    .groupby('item_id')
    .agg({'title': 'first', 'sub_total': 'sum'})
).sum()

/var/folders/s_/t8ytmm9940j564xd698kgmm00000gn/T/ipykernel_14372/2745865729.py:1: FutureWarning: The default value of numeric_only in DataFrame.sum is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  (

sub_total    468287.62
dtype: float64

In [25]:
orders['payment_sum'].sum()

468287.62